:PROPERTIES:
:ID:       db72392d-66d0-4995-90e4-27bbfa83e444
:END:
#+title: 算法
#+filetags: interview

* Footnotes

[fn:1]
#+begin_src cpp :results output :namespaces std :includes <iostream>
#include <iostream>
using namespace std;

// 辅助函数：打印二进制表示
void printBinary(int num, int bits = 8) {
    for (int i = bits - 1; i >= 0; i--) {
        cout << ((num >> i) & 1);
    }
    cout << endl;
}

int main() {
    int a = 6;  // 二进制：00000110
    int b = 10; // 二进制：00001010

    cout << "a = " << a << " -> ";
    printBinary(a);
    cout << "b = " << b << " -> ";
    printBinary(b);
    cout << endl;

    // 1. 与运算(&)：对应位都为1则为1，否则为0
    int andResult = a & b;
    cout << "a & b = " << andResult << " -> ";
    printBinary(andResult);
    // 用途：提取特定位，例如判断奇偶性(a & 1)

    // 2. 或运算(|)：对应位有一个为1则为1
    int orResult = a | b;
    cout << "a | b = " << orResult << " -> ";
    printBinary(orResult);
    // 用途：设置特定位为1

    // 3. 异或运算(^)：对应位不同则为1，相同则为0
    int xorResult = a ^ b;
    cout << "a ^ b = " << xorResult << " -> ";
    printBinary(xorResult);
    // 用途：交换两个数、翻转特定位

    // 4. 取反运算(~)：0变1，1变0
    int notResult = ~a;
    cout << "~a = " << notResult << " -> ";
    printBinary(notResult);  // 注意符号位变化
    // 用途：准备掩码

    // 5. 左移运算(<<)：各二进制位左移，高位丢弃，低位补0
    int leftShift = a << 2;  // 相当于乘以2的n次方
    cout << "a << 2 = " << leftShift << " -> ";
    printBinary(leftShift);

    // 6. 右移运算(>>)：各二进制位右移，低位丢弃，高位补符号位
    int rightShift = b >> 2;  // 相当于除以2的n次方（向下取整）
    cout << "b >> 2 = " << rightShift << " -> ";
    printBinary(rightShift);

    // 实际应用：使用位运算交换两个数（无需临时变量）
    int x = 3, y = 5;
    cout << "\n交换前: x = " << x << ", y = " << y << endl;
    x ^= y;
    y ^= x;
    x ^= y;
    cout << "交换后: x = " << x << ", y = " << y << endl;

    return 0;
}
#+end_src

#+RESULTS:
#+begin_example
a = 6 -> 00000110
b = 10 -> 00001010

a & b = 2 -> 00000010
a | b = 14 -> 00001110
a ^ b = 12 -> 00001100
~a = -7 -> 11111001
a << 2 = 24 -> 00011000
b >> 2 = 2 -> 00000010

交换前: x = 3, y = 5
交换后: x = 5, y = 3
#+end_example
